FemDesign.Loads.LoadCaseDuration
FEM-Design Load Case Duration.

FemDesign.Loads.LoadCaseDuration.Permanent
"Permanent" load case duration

FemDesign.Loads.LoadCaseDuration.LongTerm
"Long-term" load case duration

FemDesign.Loads.LoadCaseDuration.MediumTerm
"Medium-term" load case duration

FemDesign.Loads.LoadCaseDuration.ShortTerm
"Short-term" load case duration

FemDesign.Loads.LoadCaseDuration.Instantaneous
"Instantaneous" load case duration